In [1]:
import pandas as pd 
import pymongo
import dns
from pymongo import MongoClient
import os

In [2]:
# Create instance of MongoClient
client = MongoClient()
# Connection URI
# connStr = os.getenv('MONGO_CONN')
client = MongoClient('mongodb+srv://project_user:qsdapUweFvhdbouy@cluster0.l3pqt.mongodb.net/MSA?retryWrites=true&w=majority')
# Select database
db = client['MSA']
# Select the collection within the database (in this case its GDP_raw data, check list below for other collections)
df = db.AvgWeeklyEarningsAllEmp_raw
# Convert entire collection to Pandas dataframe
df_awe = pd.DataFrame(list(df.find()))
df_awe.head()

,_id,area_code,series id,year,period,period_name,value
0,60377cf51a49fbce1471a91a,10180,SMU48101800500000011,2019,M12,December,743.21
1,60377cf51a49fbce1471a91b,10180,SMU48101800500000011,2019,M11,November,703.10
2,60377cf51a49fbce1471a91c,10180,SMU48101800500000011,2019,M10,October,718.06
3,60377cf51a49fbce1471a91d,10180,SMU48101800500000011,2019,M09,September,740.00
4,60377cf51a49fbce1471a91e,10180,SMU48101800500000011,2019,M08,August,747.40

In [3]:
# dropping series id and _id columns
df_awe = df_awe.drop(columns=['series id','_id'], axis=1)
df_awe.head()

   area_code  year period period_name   value
0      10180  2019    M12    December  743.21
1      10180  2019    M11    November  703.10
2      10180  2019    M10     October  718.06
3      10180  2019    M09   September  740.00
4      10180  2019    M08      August  747.40

In [4]:
#removing M character from the period column

df_awe['period'] = df_awe['period'].str.replace('[M]', '')

In [5]:
df_awe.rename(columns={'area_code' : 'CBSA'}, inplace=True)

In [6]:
df_awe = df_awe.drop(columns=['period_name'], axis=1)
df_awe.head()

    CBSA  year period   value
0  10180  2019     12  743.21
1  10180  2019     11  703.10
2  10180  2019     10  718.06
3  10180  2019     09  740.00
4  10180  2019     08  747.40

In [7]:
df_awe.dtypes

CBSA        int64
year        int64
period     object
value     float64
dtype: object

In [8]:
# changing dtypes to int64
df_awe.astype('int64').dtypes

CBSA      int64
year      int64
period    int64
value     int64
dtype: object

In [9]:
df_awe

        CBSA  year period   value
0      10180  2019     12  743.21
1      10180  2019     11  703.10
2      10180  2019     10  718.06
3      10180  2019     09  740.00
4      10180  2019     08  747.40
...      ...   ...    ...     ...
45679  19340  2010     05  542.23
45680  19340  2010     04  545.10
45681  19340  2010     03  540.63
45682  19340  2010     02  547.15
45683  19340  2010     01  551.63

[45684 rows x 4 columns]

In [10]:
newdf = df_awe.groupby(['CBSA', 'year'])

        CBSA  year period   value
0      10180  2019     12  743.21
1      10180  2019     11  703.10
2      10180  2019     10  718.06
3      10180  2019     09  740.00
4      10180  2019     08  747.40
...      ...   ...    ...     ...
45672  19340  2010     12  585.76
45673  19340  2010     11  587.18
45674  19340  2010     10  591.83
45675  19340  2010     09  590.00
45676  19340  2010     08  574.56

[19035 rows x 4 columns]